app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 2) LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('', '', 2, '2011-01-05 05:00:15.696890', '2011-01-05 05:00:15.696890')
---
 def create
  @post = Post.find(params[:post_id])
  @comment = @post.comments.create(params[:comment])

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 2) LIMIT 1
SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 2) AND ("comments"."id" = 1) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 1)
---
 def destroy
  @post = Post.find(params[:post_id])
  @comment = @post.comments.find(params[:id])
  @comment.destroy