app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 2) LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES ('naveen', 'first blog', 'HI', '2011-01-04 07:48:07.832801', '2011-01-04 07:48:07.832801')
---
  def create
    @post = Post.new(params[:post])

  respond_to do |format|
     if @post.save

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 2) LIMIT 1
---
 def update
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 1)
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy